seb3point0/event-timer/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Octal PSRAM, as fitted on the N16R8 module.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_CODEC_ES8311_SUPPORT=y

# 1ms ticks: button gestures and the once-a-second clock both want finer
# resolution than the 10ms default.
CONFIG_FREERTOS_HZ=1000

# Development aid; leave off for normal use.
CONFIG_COUNTER_PANEL_BENCHMARK=n
CONFIG_COUNTER_AUTOSTART=n
